#Область СлужебныеПроцедурыИФункции

//////////////////////////////////////////////////////////////////////////////
// Обработчики событий подписок для документов "".

Процедура ЗаполнитьДатуДокументаПоРабочейДатеОбработкаЗаполнения(Источник, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) Экспорт
	
	Источник.Дата = ОбщегоНазначения.ТекущаяДатаПользователя();

КонецПроцедуры

Процедура ЗаполнитьДатуДокументаПоРабочейДатеПриКопировании(Источник, ОбъектКопирования) Экспорт
	
	Источник.Дата = ОбщегоНазначения.ТекущаяДатаПользователя();

КонецПроцедуры

Процедура ОбновитьРеестрСкладскихДокументовПриЗаписи(Источник, Отказ) Экспорт
	
	Если Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	РегистрыСведений.РеестрСкладскихДокументов.ОбновитьРеестрСкладскихДокументов(Источник);
	
КонецПроцедуры

#КонецОбласти
